{
  "globals": {
    "baseUrl": "",
    "twitter": "djangobirthday",
    "talks": {
      "opening-address": {
        "active": false,
        "slug": "👋",
        "title": "Opening Address",
        "time": 15
      },
      "development-milestones": {
        "active": true,
        "slug": "development-milestones",
        "title": "Development Milestones, 1.0 Onwards",
        "abstract": "Every release, Django adds some more headline features which let us get work done. We'll take a quick look at the major releases, the headline features they shipped, and wonder how we ever wrote a site with Django 1.0.",
        "time": 20,
        "speakers": [
          {
            "name": "Marc Tamlyn",
            "slug": "marc",
            "image": "/speakers/marc.255w.jpg",
            "image_srcset": "/speakers/marc.255w.jpg 255w, /speakers/marc.510w.jpg 510w, /speakers/marc.640w.jpg 640w",
            "bio": "Marc is a part of the Django core team. He's partially responsible for contrib.postgres, the Django: Under the Hood conference, <a href='http://ccbv.co.uk/'>ccbv.co.uk</a> and bringing small children to Django conferences in Europe. He's the lead developer at <a href='https://www.photocrowd.com/'>photocrowd.com</a>, based in Oxford, UK.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/mjtamlyn", "title": "twitter"}
            ]
          }
        ]
      },
      "documentation-as-empathy": {
        "active": true,
        "slug": "documentation-as-empathy",
        "title": "Documentation as Empathy",
        "abstract": "This talk will cover my view of documentation within programming culture as it has grown over the years. As a primary person involved with Read the Docs, and Write the Docs, I have seen a lot of angles, and appreciate documentation more every year. I believe better documentation is a fundamental aspect of how we can improve programming culture, and an often misunderstood part of outreach and education. Read the Docs started in Lawrence, and has grown from there. This seems like the perfect venue to wax poetic about why documentation matters, and tell the story of Read the Docs along the way. The Django community is one where documentation has always been valued, and I think that understanding how it lead to its success and why it's an important virtue going forward is important. This talk will make you think more deeply about the social impact of documentation, and hopefully make you question if it should be a higher priority in your development. ",
        "time": 20,
        "speakers": [
          {
            "name": "Eric Holscher",
            "slug": "Eric",
            "image": "/speakers/eric.255w.jpg",
            "image_srcset": "/speakers/eric.255w.jpg 255w, /speakers/eric.510w.jpg 510w, /speakers/eric.640w.jpg 640w",
            "bio": "Eric Holscher is a founder of both <a href='https://readthedocs.org/'>Read the Docs</a>, and <a href='http://conf.writethedocs.org/'>Write the Docs</a>. When he isn't helping improve the documentation world, he's out in the woods somewhere.",
            "social": [
              {"icon": "globe", "link": "http://ericholscher.com/", "title": "website"},
              {"icon": "twitter", "link": "https://twitter.com/ericholscher", "title": "twitter"}
            ]
          }
        ]
      },
      "django-nonprofit": {
        "active": true,
        "slug": "django-nonprofit",
        "title": "Django Built a Nonprofit",
        "abstract": "Founded in 2008, the Sunlight Foundation is a nonprofit that uses the civic tech to make government more accountable and transparent. From a single Drupal site, to an organization powered by Django, we’ll tell the story of how a Python web framework built a successful nonprofit. The history of our open source Django apps tell the story of a growing organization and an open government movement. We'll cover various Django apps we have published and how each reflected the state of our organization, the open government community, or Django at the time they were created.",
        "time": 15,
        "speakers": [
          {
            "name": "James Turk",
            "slug": "james",
            "image": "/speakers/james.255w.jpg",
            "image_srcset": "/speakers/james.255w.jpg 255w, /speakers/james.510w.jpg 510w, /speakers/james.640w.jpg 640w",
            "bio": "We have been with Sunlight Foundation for 8 years. When we started, Sunlight's web properties were built with PHP and Drupal. We transitioned the organization to Python and Django (0.96) and participated in the Django 1.0 sprint in DC.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/jamesturk", "title": "twitter"},
              {"icon": "github", "link": "https://github.com/jamesturk", "title": "github"}
            ]
          },
          {
            "name": "Jeremy Carbaugh",
            "slug": "jeremy",
            "image": "/speakers/jeremy.jpg",
            "image_srcset": "/speakers/jeremy.255w.jpg 255w, /speakers/jeremy.510w.jpg 510w, /speakers/jeremy.640w.jpg 640w",
            "bio": "I am a senior developer at Sunlight Foundation, focusing on web and iOS development. Prior to joining Sunlight, I worked as a government contractor developing software for the likes of the IRS, FBI and Treasury.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/jcarbaugh", "title": "twitter"},
              {"icon": "github", "link": "https://github.com/jcarbaugh", "title": "github"}
            ]
          }
        ]
      },
      "intermezzo": {
        "active": false,
        "slug": "🎶",
        "title": "Intermezzo",
        "time": 15
      },
      "am-break": {
        "active": false,
        "slug": "🕚☕️",
        "title": "Break",
        "time": 20
      },
      "give-python-pony": {
        "active": true,
        "slug": "🐍➡️🐴",
        "title": "Give a Python a Pony",
        "abstract": "A couple of years ago, I was faced with one of the scariest situations there is for a self-employed developer: I was burned out. The blinking cursor in Vim was taunting me and no number of GitHub issues could motivate me to churn out more than a few lines of code in a day. This burnout, though, led me back to an early love: I started teaching full time.<br/><br/>This is a talk in two parts. In part one, I’ll talk about some of the teaching triumphs I’ve had and witnessed thanks to a new career, the Python and Django worlds, and my employer, Treehouse (and others!). In the second part, I’ll share ways you can start teaching in your own communities and using your own talents, so we can all make the world better through learning.",
        "time": 20,
        "speakers": [
          {
            "name": "Kenneth Love",
            "slug": "❤️",
            "image": "/speakers/love.255w.jpg",
            "image_srcset": "/speakers/love.255w.jpg 255w, /speakers/love.510w.jpg 510w, /speakers/love.640w.jpg 640w",
            "bio": "I'm the Python teacher for Treehouse where I get to teach thousands of people about Python, Flask, and Django through videos, quizzes, and code challenges. I've also done technical editing for a few different Python and Django books. I also did my own videos about Django years ago and created the django-braces package to help people with their class-based generic views.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/kennethlove", "title": "twitter"},
              {"icon": "globe", "link": "http://teamtreehouse.com/hello", "title": "website"}
            ]
          }
        ]
      },
      "a-more-accessible-django-girls": {
        "active": true,
        "slug": "a-more-accessible-django-girls",
        "title": "A More Accessible Django Girls",
        "abstract": "Appropriate planning and accommodations make Django Girls workshops and other tech events more open to many groups, including people with disabilities, Deaf attendees, attendees with mental illnesses, and more. You'll leave this talk with some concrete things you can do to make your next meetup, workshop, or conference more inclusive of people with disabilities, including how to advertise your accommodations, what to look for in a venue, and some free tools to help your website be more accessible.",
        "time": 20,
        "speakers": [
          {
            "name": "Lacey Williams Henschel",
            "slug": "lacey",
            "image": "/speakers/lacey.255w.jpg",
            "image_srcset": "/speakers/lacey.255w.jpg 255w, /speakers/lacey.510w.jpg 510w, /speakers/lacey.640w.jpg 640w",
            "bio": "Lacey is a senior software developer for the University of Texas at Austin, but she telecommutes from Portland, OR. She's the co-organizer of <a href='http://djangogirls.org/portland/'>Django Girls Portland</a> and <a href='http://djangogirls.org/djangoconus/'>Django Girls Austin (happening at DjangoCon)</a>, and the Diversity Chair and Financial Aid Chair for <a href='https://2015.djangocon.us/'>DjangoCon US</a>. She recently wrote an article for Model View Culture on making tech events more accessible to people with disabilities. In her spare time, she's a Big Sister with Big Brothers Big Sisters, serves on the technical board of <a href='http://projectcallisto.org/'>Project Callisto</a>, and tries desperately to develop a green thumb.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/laceynwilliams", "title": "twitter"}
            ]
          }
        ]
      },
      "django-conspirancy": {
        "active": true,
        "slug": "django-conspirancy",
        "title": "Django: The Conspiracy",
        "abstract": "Ten years after the project known as \"Django\" was released to the public, there are still unanswered questions. Why did one of the original authors flee the country? What happened to all the removed magic? And, more importantly, why are there secret messages hidden in the template parser's regular expressions? I'll be attempting to throw light on some of the dark secrets of Django and, perhaps, finally divine its true purpose, after almost a decade of searching.",
        "time": 20,
        "speakers": [
          {
            "name": "Andrew Godwin",
            "slug": "andrew",
            "image": "/speakers/andrew.255w.jpg",
            "image_srcset": "/speakers/andrew.255w.jpg 255w, /speakers/andrew.510w.jpg 510w, /speakers/andrew.640w.jpg 640w",
            "bio": "Django core developer, backend engineer, occasional game developer, cheese appreciator, archer and pilot. The chances of finding him at a Django event are relatively high.",
            "social": [
              {"icon": "globe", "link": "http://www.aeracode.org/", "title": "website"},
              {"icon": "twitter", "link": "https://twitter.com/andrewgodwin", "title": "twitter"}
            ]
          }
        ]
      },
      "lunch": {
        "active": false,
        "slug": "🍴",
        "title": "Lunch",
        "time": 45
      },
      "snakes-ponies-balloons": {
        "active": true,
        "slug": "🐍🐴🎈",
        "title": "Snakes, Ponies and Balloons: Stories of Teaching Django to Thousands of Women",
        "abstract": "Django Girls is a workshop for total beginners into the world of web building. Started by two Polish girls in Berlin and now organized all over the world in 45 cities, Django Girls aim to inspire women to fell in love with programming. Ola will share with you how she went from not knowing anything about teaching programming or feminism, to knowing a little bit more thanks to thousands of people who participated in the workshop formula Django Girls created. You'll learn the secrets of explaining the Internet, servers or Django ORM to people who never done this before. And how to find 100+ women who want to learn to code just about anywhere. This talk is your introduction to the world of getting girls excited about snakes, ponies and balloons.",
        "time": 30,
        "speakers": [
          {
            "name": "Ola Sitarska",
            "slug": "ola",
            "image": "/speakers/ola.255w.jpg",
            "image_srcset": "/speakers/ola.255w.jpg 255w, /speakers/ola.510w.jpg 510w, /speakers/ola.765w.jpg 765w",
            "bio": "Ola Sitarska is a Django Developer at <a href='https://p.ota.to/'>Potato</a>. She started working with Django 6 years ago, when she discovered the power of Django admin and quickly fell in love with the beauty of Python. Last year, Ola started <a href='https://djangogirls.org/'>Django Girls</a>, an initiative to inspire more women to become programmers. Together with Ola Sendecka, she also co-authored the <a href='https://tutorial.djangogirls.org/'>Django Girls Tutorial</a>, which has been visited by more than 30.000 people so far. She is also a member of the Django Core Team, and part of the team responsible for the shipping of <a href='https://djangoproject.com/'>djangoproject.com</a> redesign. In 2015, she became a <a href='https://djangoproject.com/foundation/'>Django Software Foundation</a> board member. Ola is also known as A Person With The <a href='https://2013.djangocon.eu/'>Django Circus</a> Idea™. Her superpower is unstoppable enthusiasm.",
            "social": [
              {"icon": "twitter", "link": "http://twitter.com/olasitarska", "title": "twitter"}
            ]
          }
        ]
      },
      "born-lfk": {
        "active": true,
        "slug": "born-lfk",
        "title": "Born in (the) #LFK",
        "abstract": "It’s fitting that we gather in Lawrence, Kansas, to celebrate the 10th birthday of Django, developed and first put to use in the basement of what was once a US Post Office in downtown Lawrence. After all, as I hope to show, our lovely #LFK has a history of influencing the wider world.",
        "time": 30,
        "speakers": [
          {
            "image": "/speakers/david.255w.jpg",
            "image_srcset": "/speakers/david.255w.jpg 255w, /speakers/david.510w.jpg 510w, /speakers/david.640w.jpg 640w",
            "name": "David Ryan",
            "slug": "david-ryan",
            "bio": "David had the pleasure of being a web designer at LJWorld.com when Django was created. Prior to working for LJWorld.com, he was in the Ph.D. program at the University of Kansas focusing on Herman Melville and 19th-century American literature. In August he’ll be moving to Chengdu, China, to teach English and, ideally, to hang out with Pandas and feed them bamboo.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/davidorex", "title": "twitter"}
            ]
          }
        ]
      },
      "TBD": {
        "active": true,
        "slug": "something-javascript",
        "title": "TBD",
        "abstract": "TBD",
        "time": 20,
        "speakers": [
          {
            "name": "Mikeal Rogers",
            "slug": "mikeal",
            "image": "/speakers/mikeal.jpg",
            "image_srcset": "/speakers/mikeal.255w.jpg 255w, /speakers/mikeal.510w.jpg 510w, /speakers/mikeal.640w.jpg 640w",
            "bio": "JS Community Organizer",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/mikeal", "title": "twitter"},
              {"icon": "github", "link": "https://github.com/mikeal", "title": "github"},
              {"icon": "globe", "link": "http://mikealrogers.com/", "title": "website"}
            ]
          }
        ]
      },
      "7yrs-w-django": {
        "active": true,
        "slug": "7yrs-w-django",
        "title": "7 Years With Django, to Core Developer and Back",
        "abstract": "One night, in September 2007, I read every page of Django's documentation and the entire (then draft) Django Book. Over the next few years I became a frequent contributor to Django, including becoming a core developer and later a member of the DSF board. Now I'm largely uninvolved with Django's development. This talk is the story of my time with Django. This talk is a walk through my time with Django -- from emailing Adrian to ask about attending a sprint that had already happened, to contributing patches, to the multi-db GSOC, to Eric Florenzano's keynote, becoming a core developer, joining the board, to slowly fading away and becoming an emeritus developer.",
        "time": 20,
        "speakers": [
          {
            "name": "Alex Gaynor",
            "slug": "alex",
            "image": "/speakers/alex.255w.jpg",
            "image_srcset": "/speakers/alex.255w.jpg 255w, /speakers/alex.510w.jpg 510w, /speakers/alex.683w.jpg 683w",
            "bio": "I'm an emeritus Django core developer and former DSF director. I'm a software engineer for the United States Department of Veterans Affairs, and a director of the Python Software Foundation. I live in Washington D.C.",
            "social": [
              {"icon": "globe", "link": "https://alexgaynor.net/", "title": "website"},
              {"icon": "github", "link": "https://github.com/alex", "title": "github"}
            ]
          }
        ]
      },
      "django-mexico": {
        "active": true,
        "slug": "django-mexico",
        "title": "The Mysterious Django Community in Mexico",
        "abstract": "When I set out to bring Django Girls to the city of Tijuana, I never expected to find so many programmers. Even more unexpected was a small group of Python/Django developers I found, passionate about kickstarting the Python community in Baja California. As Django Girls (and later, Django Girls Ensenada) came and went, I learned more about the Django community in other cities of Mexico, including the reason why I never heard of them before organizing the workshop.",
        "time": 20,
        "speakers": [
          {
            "name": "Andrea Gonzalez",
            "slug": "andrea",
            "image": "/speakers/andrea.255w.jpg",
            "image_srcset": "/speakers/andrea.255w.jpg 255w, /speakers/andrea.510w.jpg 510w, /speakers/andrea.640w.jpg 640w",
            "bio": "​Django Developer and Django Girls organizer. In love with Python. Geeks out on life. Other interests include sunsets, time travel, photography and regular travel. Currently resides in the delightful city of Tijuana, Baja California.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/andiosuna", "title": "twitter"},
              {"icon": "github", "link": "https://github.com/andyosuna", "title": "github"}
            ]
          }
        ]
      },
      "pm-break": {
        "active": false,
        "slug": "🕒☕️",
        "title": "Break",
        "time": 20
      },
      "django-things": {
        "active": true,
        "slug": "django-things",
        "title": "Some Things I've Made With Django",
        "abstract": "TBD",
        "time": 30,
        "speakers": [
          {
            "name": "Simon Willison",
            "slug": "simon",
            "image": "/speakers/simon.255w.jpg",
            "image_srcset": "/speakers/simon.255w.jpg 255w, /speakers/simon.510w.jpg 510w, /speakers/simon.640w.jpg 640w",
            "bio": "Simon Willison runs the software architecture team at Eventbrite. Prior to that he was the co-founder of <a href='http://lanyrd.com/'>Lanyrd.com</a>, a Y Combinator funded company which helps people find conferences, user groups and other knowledge-sharing events to attend or speak at. He has previously worked in London for the Guardian and Yahoo!. Simon is a co-creator of the Django Web Framework.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/simonw", "title": "twitter"},
              {"icon": "globe", "link": "http://lanyrd.com/profile/simonw/", "title": "website"}
            ]
          }
        ]
      },
      "django-dreams": {
        "active": true,
        "slug": "django-dreams",
        "title": "Django Dreams",
        "abstract": "An exposé on what the future of Django could look like, from Kenneth’s perspective. Let’s strive to make the world a better place, with Django as a centerpoint.",
        "time": 30,
        "speakers": [
          {
            "name": "Kenneth Reitz",
            "slug": "kenneth",
            "image": "/speakers/kenneth.255w.jpg",
            "image_srcset": "/speakers/kenneth.255w.jpg 255w, /speakers/kenneth.510w.jpg 510w, /speakers/kenneth.640w.jpg 640w",
            "bio": "Kenneth Reitz is the product owner of Python at Heroku, and a member of the Python Software Foundation. As the author of Requests, he has an enormously broad perspective on the needs and desires of Django users and the general Python community.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/kennethreitz", "title": "twitter"},
              {"icon": "globe", "link": "http://www.kennethreitz.org/", "title": "website"}
            ]
          }
        ]
      },
      "django-health": {
        "active": true,
        "slug": "django-health",
        "title": "How Django Is Good for Your Health",
        "abstract": "You know Django as the web framework behind sites like Instagram and Pinterest, but Django is used in many places now. One such place is the pharmaceutical industry, which is the definition of large corporate enterprises. Drug discovery is an immensely hard and expensive challenge. Believe it or not Django can play a meaningful role in that endeavor and ultimately be good for your health. ",
        "time": 15,
        "speakers": [
          {
            "name": "Craig Bruce",
            "slug": "craig",
            "image": "/speakers/changeme.255w.jpg",
            "image_srcset": "/speakers/changeme.255w.jpg 255w, /speakers/changeme.510w.jpg 510w, /speakers/changeme.640w.jpg 640w",
            "bio": "Following his PhD from the University of Nottingham in Cheminformatics Craig moved to AstraZeneca Pharmaceuticals as a Scientific Computing Specialist. He took a Django project used by chemists worldwide and transplanted it into a highly available cluster, upgrading every hardware and software component along the way. Since then he moved to Santa Fe, NM to work on the scientific cloud offerings at OpenEye Scientific Software, which are also written in Django and hosted completely on Amazon Web Services.",
            "social": [
              {"icon": "twitter", "link": "https://twitter.com/craigbruce", "title": "twitter"}
            ]
          }
        ]
      },
      "django-regrets": {
        "active": true,
        "title": "Django Regrets",
        "slug": "django-regrets",
        "abstract": "With the benefit of hindsight, here are a bunch of things I've regretted about doing, and not doing, in helping develop Django. Learn from my mistakes!",
        "time": 30,
        "speakers": [
          {
            "name": "Adrian Holovaty",
            "slug": "adrian",
            "image": "/speakers/adrian.255w.jpg",
            "image_srcset": "/speakers/adrian.255w.jpg 255w, /speakers/adrian.510w.jpg 510w, /speakers/adrian.600w.jpg 600w",
            "bio": "Adrian is co-creator and former co-BDFL of Django. He was working as lead developer at World Online when the team decided to open-source their homegrown collection of web development tools. These days he's making <a href='http://soundslice.com/'>Soundslice</a>.",
            "social": [
              {"icon": "globe", "link": "http://www.holovaty.com/", "title": "website"},
              {"icon": "twitter", "link": "https://twitter.com/adrianholovaty", "title": "twitter"},
              {"icon": "youtube", "link": "https://www.youtube.com/adrianholovaty", "title": "youtube"}
            ]
          }
        ]
      },
      "closing-address": {
        "active": false,
        "slug": "👏",
        "title": "Closing Address",
        "time": 15
      },
      "changeme": {
        "active": false,
        "slug": "changemme",
        "title": "ChangeMe",
        "abstract": "abstract",
        "speakers": [
          {
            "image": "/speakers/changeme.255w.jpg",
            "image_srcset": "/speakers/changeme.255w.jpg 255w, /speakers/changeme.510w.jpg 510w, /speakers/changeme.640w.jpg 640w",
            "name": "Firstname Lastname",
            "slug": "slug"
          }
        ]
      }
    }
  }
}
