{
    "index": {
        "talks": [
            {
                "active": false,
                "slug": "django-regrets",
                "speaker": {
                    "image": "/speakers/adrian.255w.jpg",
                    "image_srcset": "/speakers/adrian.255w.jpg 255w, /speakers/adrian.600w.jpg 600w",
                    "name": "Adrian Holovaty",
                    "slug": "adrian"
                },
                "title": "Django Regrets",
                "abstract": ""
            },
            {
                "active": true,
                "slug": "🐍🐴🎈",
                "speaker": {
                    "image": "/speakers/ola.255w.jpg",
                    "image_srcset": "/speakers/ola.255w.jpg 255w, /speakers/ola.510w.jpg 510w, /speakers/ola.765w.jpg 765w",
                    "name": "Ola Sitarska",
                    "slug": "ola"
                },
                "title": "Snakes, ponies and balloons: stories of teaching Django to thousands of women.",
                "abstract": "Django Girls is a workshop for total beginners into the world of web building. Started by two Polish girls in Berlin and now organized all over the world in 45 cities, Django Girls aim to inspire women to fell in love with programming. Ola will share with you how she went from not knowing anything about teaching programming or feminism, to knowing a little bit more thanks to thousands of people who participated in the workshop formula Django Girls created. You'll learn the secrets of explaining the Internet, servers or Django ORM to people who never done this before. And how to find 100+ women who want to learn to code just about anywhere. This talk is your introduction to the world of getting girls excited about snakes, ponies and balloons."
            },
            {
                "active": true,
                "slug": "7yrs-w-django",
                "speaker": {
                    "image": "/speakers/alex.255w.jpg",
                    "image_srcset": "/speakers/alex.255w.jpg 255w, /speakers/alex.510w.jpg 510w, /speakers/alex.683w.jpg 683w",
                    "name": "Alex Gaynor",
                    "slug": "alex"
                },
                "title": "7 years with Django, to core developer and back",
                "abstract": "One night, in September 2007, I read every page of Django's documentation and the entire (then draft) Django Book. Over the next few years I became a frequent contributor to Django, including becoming a core developer and later a member of the DSF board. Now I'm largely uninvolved with Django's development. This talk is the story of my time with Django. This talk is a walk through my time with Django -- from emailing Adrian to ask about attending a sprint that had already happened, to contributing patches, to the multi-db GSOC, to Eric Florenzano's keynote, becoming a core developer, joining the board, to slowly fading away and becoming an emeritus developer."
            },
            {
                "active": true,
                "slug": "a-more-accessible-django-girls",
                "speaker": {
                    "image": "/speakers/lacey.255w.jpg",
                    "image_srcset": "/speakers/lacey.255w.jpg 255w, /speakers/lacey.510w.jpg 510w, /speakers/lacey.640w.jpg 640w",
                    "name": "Lacey Williams Henschel",
                    "slug": "lacey"
                },
                "title": "A More Accessible Django Girls",
                "abstract": "Appropriate planning and accommodations make Django Girls workshops and other tech events more open to many groups, including people with disabilities, Deaf attendees, attendees with mental illnesses, and more. You'll leave this talk with some concrete things you can do to make your next meetup, workshop, or conference more inclusive of people with disabilities, including how to advertise your accommodations, what to look for in a venue, and some free tools to help your website be more accessible."
            },
            {
                "active": true,
                "slug": "django-conspirancy",
                "speaker": {
                    "image": "/speakers/andrew.255w.jpg",
                    "image_srcset": "/speakers/andrew.255w.jpg 255w, /speakers/andrew.510w.jpg 510w, /speakers/andrew.640w.jpg 640w",
                    "name": "Andrew Godwin",
                    "slug": "andrew"
                },
                "title": "Django: The Conspiracy",
                "abstract": "Ten years after the project known as \"Django\" was released to the public, there are still unanswered questions. Why did one of the original authors flee the country? What happened to all the removed magic? And, more importantly, why are there secret messages hidden in the template parser's regular expressions? I'll be attempting to throw light on some of the dark secrets of Django and, perhaps, finally divine its true purpose, after almost a decade of searching."
            },
            {
                "active": false,
                "slug": "djano-mexico",
                "title": "Django in Mexico",
                "abstract": "",
                "speaker": {
                    "slug": "andrea",
                    "image": "/speakers/andrea.255w.jpg",
                    "image_srcset": "/speakers/andrea.255w.jpg 255w, /speakers/andrea.510w.jpg 510w, /speakers/andrea.640w.jpg 640w",
                    "name": "Andrea Gonzalez"
                }
            },
            {
                "active": false,
                "slug": "development-milestones",
                "speaker": {
                    "image": "/speakers/marc.255w.jpg",
                    "image_srcset": "/speakers/marc.255w.jpg 255w, /speakers/marc.510w.jpg 510w, /speakers/marc.640w.jpg 640w",
                    "name": "Marc Tamlyn",
                    "slug": "marc"
                },
                "title": "Development milestones, 1.0 onwards",
                "abstract": "Every release, Django adds some more headline features which let us get work done. We'll take a quick look at the major releases, the headline features they shipped, and wonder how we ever wrote a site with Django 1.0."
            },
            {
                "active": true,
                "slug": "documentation-as-empathy",
                "speaker": {
                    "image": "/speakers/eric.255w.jpg",
                    "image_srcset": "/speakers/eric.255w.jpg 255w, /speakers/eric.510w.jpg 510w, /speakers/eric.640w.jpg 640w",
                    "name": "Eric Holscher",
                    "slug": "Eric"
                },
                "title": "Documentation as Empathy",
                "abstract": "This talk will cover my view of documentation within programming culture as it has grown over the years. As a primary person involved with Read the Docs, and Write the Docs, I have seen a lot of angles, and appreciate documentation more every year. I believe better documentation is a fundamental aspect of how we can improve programming culture, and an often misunderstood part of outreach and education. Read the Docs started in Lawrence, and has grown from there. This seems like the perfect venue to wax poetic about why documentation matters, and tell the story of Read the Docs along the way. The Django community is one where documentation has always been valued, and I think that understanding how it lead to its success and why it's an important virtue going forward is important. This talk will make you think more deeply about the social impact of documentation, and hopefully make you question if it should be a higher priority in your development. "
            }
        ]
    }
}
